/**************************************************************************
--現在のIDENTITYの確認　最後尾のIDが表示される　次に自動追加されるのは表示＋１
**************************************************************************/
  SELECT IDENT_CURRENT('[Kawauchi_DB].[dbo].[テーブル名]') AS ID

/**************************************************************************
--自動追加されるIDの値を変える　最後尾のIDの数値を入力　次に自動追加されるのは入力値＋１
**************************************************************************/
  DBCC CHECKIDENT(テーブル名, RESEED, 最後尾のIDの数値)
